#include "modding.h"
#include "recomputils.h"
#include "custom_gamebits.h"

#include "dlls/engine/27.h"
#include "dlls/engine/53_movelib.h"
#include "dlls/objects/common/sidekick.h"
#include "game/gamebits.h"
#include "game/objects/interaction_arrow.h"
#include "sys/curves.h"
#include "sys/joypad.h"
#include "sys/main.h"
#include "sys/objects.h"
#include "sys/objexpr.h"
#include "sys/objtype.h"
#include "sys/rand.h"
#include "macros.h"
#include "dll.h"

#include "recomp/dlls/objects/508_SHthorntail_recomp.h"

typedef struct {
/*000*/ MoveLibData movedata;
/*4B8*/ s8 state;
/*4B9*/ u8 _unk4B9;
/*4BA*/ u8 flags;
/*4BB*/ u8 mapAct;
/*4BC*/ s8 grazingAltAnimSelector;
/*4BD*/ u8 nextSeq; // next seq in rotation to play on interact
/*4BE*/ u8 _unk4BE[0x4C0 - 0x4BE];
/*4C0*/ u8* talkSeqs;
/*4C4*/ u8 talkSeqsCount; // number of seqs in rotation
/*4C5*/ u8 _unk4C5[0x4D0 - 0x4C5];
/*4D0*/ s16 eatingTimer;
/*4D2*/ s16 grazingTimer;
/*4D4*/ s16 drinkTimer;
/*4D6*/ s16 targetAngle;
/*4D8*/ s16 angleToTarget;
/*4DA*/ s16 startAngle;
/*4DC*/ s16 progressionBlockerGamebit;
/*4E0*/ s32 unk4E0;
/*4E4*/ DLL27_Data collider;
/*744*/ u8 _unk744[0x75C - 0x744];
/*75C*/ CurveSetup* prevCurve;
/*760*/ CurveSetup* currentCurve;
/*764*/ CurveSetup* targetCurve;
/*768*/ u8 _unk768[0x804 - 0x768];
/*804*/ f32 modAnimDelta;
/*808*/ f32 walkSpeed;
/*80C*/ u8 _unk80C[0x840 - 0x80C];
/*840*/ f32 playerDist;
/*844*/ f32 distToTargetCurve;
/*848*/ f32 unk848;
/*84C*/ f32 unk84C;
/*850*/ HeadAnimation headAnim;
/*874*/ u8 unk874;
/*875*/ u8 _unk875[0x878 - 0x875];
// @recomp
    u8 wakingFromDistract;
} SHthorntail_Data;

typedef struct {
/*00*/ ObjSetup base;
/*18*/ u8 thorntail; // which Thorntail this is
/*19*/ u8 yaw;          //@recomp: custom param
/*1A*/ s16 gamebitAway; //@recomp: ThornTail doesn't show up when set
} SHthorntail_Setup;

enum ThorntailSeq {
    THORNTAILSEQ_0_HaveYouWokenTheSwapStone = 0, // 0x275
    THORNTAILSEQ_1_LeaveMeAloneStranger = 1, // 0x276
    THORNTAILSEQ_2_ALogForAFish = 2, // 0x277
    THORNTAILSEQ_3_IDontWantThat = 3, // 0x278
    THORNTAILSEQ_4_NoLogsToday = 4, // 0x279
    THORNTAILSEQ_5_NoLogsToday2 = 5, // 0x27A
    THORNTAILSEQ_6_HowsRandorn = 6, // 0x27B
    THORNTAILSEQ_7_ItsANiceDay = 7, // 0x27C
    THORNTAILSEQ_8_TheSharpClawDrainedOurRiver = 8, // 0x27D
    THORNTAILSEQ_9_Unknown = 9, // 0x27E
    THORNTAILSEQ_10_ThornsBlockingBurrows = 10, // 0x27F
    THORNTAILSEQ_11_ArentLikeTheyUsedToBe = 11 // 0x280
};

enum ThorntailFlags {
    THORNTAILFLAG_ModAnimDone = 0x1,
    THORNTAILFLAG_AtTarget = 0x2,
    THORNTAILFLAG_Walking = 0x4,
    THORNTAILFLAG_ForceModAnimChange = 0x8,
    THORNTAILFLAG_GoToNextNode = 0x10,
    THORNTAILFLAG_ProgressionBlocker = 0x20,
    THORNTAILFLAG_RotateTalkSeqs = 0x40
};

enum ThorntailState {
    THORNTAILSTATE_Grazing = 0,
    THORNTAILSTATE_Grazing_LookingAround = 1,
    THORNTAILSTATE_Grazing_Swallowing = 2,
    THORNTAILSTATE_MoveToTarget = 3,
    THORNTAILSTATE_TurnLeft = 4,
    THORNTAILSTATE_TurnRight = 5,
    THORNTAILSTATE_StartDrinking = 6,
    THORNTAILSTATE_Drinking = 7,
    THORNTAILSTATE_DoneDrinking = 8,
    THORNTAILSTATE_Idle = 9,
    THORNTAILSTATE_BlockingProgression = 10,
    THORNTAILSTATE_WakingUp = 11,
    THORNTAILSTATE_LookingAround = 12,
    THORNTAILSTATE_Sleeping = 13,
    THORNTAILSTATE_FallingAsleep = 14
};

enum ThorntailStateFlags {
    THORNTAILSTATEFLAG_NoTargeting = 0x1,
    THORNTAILSTATEFLAG_Asleep = 0x2
};

enum ThorntailIndex {
    THORNTAIL_1_Sleepy = 1,     // The sleepy-voiced ThornTail near the tree hollow/river crossing
    THORNTAIL_2_Log_Trader = 2, // The ThornTail near the burrows behind Rocky
    THORNTAIL_3_Elder = 3,       // The elderly ThornTail near Willow Grove
    // @recomp:
    THORNTAIL_4_Willow_Grove = 4 //Extra ThornTail blocking Willow Grove (like the one MusicalProgrammer added in older patches) TODO: config for this?
};

enum ThorntailCurveSubtype {
    // trader middle nodes, can always navigate to.
    THORNTAILCURVE_0 = 0,
    // in front of well (sleepy), in front of burrows (trader), spore patch (elder).
    // never returned to.
    THORNTAILCURVE_3 = 3,
    // river deadend (for drinking) (sleepy).
    // can navigate to if unk4E0 == 9
    THORNTAILCURVE_4 = 4,
    // elder nodes, most of sleepy nodes, trader dead end.
    // can navigate to if unk4E0 != 9
    THORNTAILCURVE_8 = 8,
    // some of sleepy's nodes are this.
    // can always navigate to.
    THORNTAILCURVE_9 = 9
};

extern CurveSetup* thorntail_find_closest_curve(f32 x, f32 y, f32 z, s32 curveSubtype);
extern int thorntail_anim_callback(Object *actor, Object *animObj, AnimObj_Data *animObjData, s8 a3);
extern void thorntail_common_control(Object* self, SHthorntail_Data* objdata, SHthorntail_Setup* setup);
extern void thorntail_sleepy_setup(Object *self, SHthorntail_Data *objdata, SHthorntail_Setup *setup);
extern void thorntail_sleepy_init(Object *self, SHthorntail_Data *objdata, SHthorntail_Setup *setup);
extern void thorntail_trader_setup(Object *self, SHthorntail_Data *objdata, SHthorntail_Setup *setup);
extern void thorntail_elder_setup(Object *self, SHthorntail_Data *objdata, SHthorntail_Setup *setup);
extern void thorntail_update_shadow(Object* self);
extern void thorntail_sleepy_control(Object* self, SHthorntail_Data* objdata, SHthorntail_Setup* setup);
extern void thorntail_trader_control(Object* self, SHthorntail_Data* objdata, SHthorntail_Setup* setup);
extern void thorntail_elder_control(Object* self, SHthorntail_Data* objdata, SHthorntail_Setup* setup);

extern Vec3f data_0[];
extern f32 data_30[];
extern Unk80026DF4 data_40[];
extern u8 sStateFlagMap[];
/*0x16C*/ extern s16 sModAnimMap[];
/*0x1B8*/ extern f32 data_1B8[];
/*0x1FC*/ extern u8 sElderTalkSeqs[1];

RECOMP_PATCH void thorntail_setup(Object *self, SHthorntail_Setup *setup, s32 reset) {
    SHthorntail_Data *objdata = self->data;
    s32 _pad;
    u8 sp3C[] = {1, 1, 1, 1}; // data_224

    switch (setup->thorntail) {
    case THORNTAIL_1_Sleepy:
        thorntail_sleepy_setup(self, objdata, setup);
        break;
    case THORNTAIL_2_Log_Trader:
        thorntail_trader_setup(self, objdata, setup);
        break;
    case THORNTAIL_3_Elder:
        thorntail_elder_setup(self, objdata, setup);
        break;
    //@recomp: custom extra ThornTail
    case THORNTAIL_4_Willow_Grove:
        self->srt.yaw = setup->yaw << 8;
        return;
    }

    gDLL_27->vtbl->init(&objdata->collider, DLL27FLAG_4000000 | DLL27FLAG_2000000, DLL27FLAG_400, DLL27MODE_1);
    gDLL_27->vtbl->setup_terrain_collider(&objdata->collider, 4, data_0, data_30, sp3C);
    gDLL_27->vtbl->reset(self, &objdata->collider);

