#include "modding.h"
#include "recompconfig.h"

#include "dlls/engine/18_objfsa.h"
#include "dlls/engine/33.h"
#include "dlls/objects/214_animobj.h"
#include "sys/gfx/model.h"
#include "sys/gfx/modgfx.h"
#include "sys/main.h"
#include "sys/objanim.h"
#include "sys/objhits.h"
#include "sys/objmsg.h"
#include "sys/objtype.h"
#include "segment_334F0.h"
#include "dll.h"

/**
 * Summary of recomp changes
 * ******************************
 * Vanilla (patches):
 * - Fix "move and check turn" logic to avoid softlock where boss keeps turning in place forever.
 * - Handle final ktdata pos update when transitioning into a turn. Ensures the boss is in the exact
 *   correct position before the turn 100% of the time.
 * - Play defeat cutscene and updated WC object groups after winning the fight.
 * - Fix case where boss could "see" the player when they are behind or directly underneath the boss.
 * - Correctly handle chargeCounter > 1, avoiding a badly desynced state.
 * - Lower floor switches immediately after zapping boss. Matches SFA behavior and possibly helps avoid
 *   a buggy end cutscene. Just a nice change to have, doesn't affect gameplay.
 * - Remove vulnerable flag immediately after logic state 8. Prevents the "fight progress" from being
 *   getting desynced leading to an eventual softlock.
 * - Ensure KT_RexDoorTrex closes even if the intro cutscene is skipped.
 *
 * Enhanced:
 * - Reduce vulnerable time as the fight progresses.
 * - Increase move speed during full charge (just a little).
 * - Skip "charge end" state after a normal charge (matches SFA).
 * - Use a different animation for a full charge end that plays a roar sound normally missing due to a bug.
 * - Switch to unused "intense" fight music while boss is charging (or preparing a charge).
 * - Don't let boss do a 180 if the player is in view.
 *
 * Enhanced (Hard Mode):
 * - Adjustments to speed, vulnerable times, and reverse/charge chances.
 * - Silent 180 turns.
 * - Sometimes charges for an extra segment.
 * - Always charges around the corner during the last phase if the player is in the next segment.
 */

enum KTRecompMode {
    KT_RECOMP_VANILLA,
    KT_RECOMP_ENHANCED,
    KT_RECOMP_HARD
};

static int dinomod_kt_enhanced(void) {
    return recomp_get_config_u32("kt_mode") != KT_RECOMP_VANILLA;
}

static int dinomod_kt_hard(void) {
    return recomp_get_config_u32("kt_mode") == KT_RECOMP_HARD;
}

#include "recomp/dlls/objects/702_KTrex_recomp.h"

enum KTLogicStates {
    KT_LSTATE_0 = 0,
    KT_LSTATE_1_DEFEATED = 1,
    KT_LSTATE_2_WALK = 2,
    KT_LSTATE_3_TURN_CORNER = 3,
    KT_LSTATE_4_ROAR = 4,
    KT_LSTATE_5_CHARGE = 5,
    KT_LSTATE_6_CHARGE_END = 6,
    KT_LSTATE_7_ZAPPED = 7,
    KT_LSTATE_8_ON_GROUND = 8,
    KT_LSTATE_9_STAND_UP = 9,
    KT_LSTATE_10_FULL_CHARGE = 10,
    KT_LSTATE_11_REVERSE = 11
};

enum KTAnimStates {
    KT_ASTATE_0 = 0,
    KT_ASTATE_1_MOVING_STRAIGHT = 1,
    KT_ASTATE_2_TURN_90 = 2,
    KT_ASTATE_3_TURN_180 = 3,
    KT_ASTATE_4_ROAR = 4,
    KT_ASTATE_5_CHARGE_END = 5,
    KT_ASTATE_6_ZAPPED = 6,
    KT_ASTATE_7_ON_GROUND = 7,
    KT_ASTATE_8_STAND_UP = 8
};

enum KTFlags {
    // Whether the boss is moving clockwise (0) or counter-clockwise (1) around the arena.
    KTFLAG_REVERSED = 0x1,
    // Which arena segment the boss is in.
    // Bits 1-2.
    KTFLAG_SEGMENT = 0x6,
    // Whether the boss was just damaged by the player.
    KTFLAG_DAMAGED = 0x8,
    // Whether the boss can be damaged.
    KTFLAG_VULNERABLE = 0x10,
    // Whether the random chance reverse/charge was already rolled for the current logic state.
    KTFLAG_ROLLED_CHANCE = 0x20
};

#define KTFLAG_GET_SEGMENT(ktflags) ((ktflags >> 1) & 3)
#define KTFLAG_SET_SEGMENT(segment) (segment << 1)

// Note: This is not the only object data. DLL 33 data is prepended to this in memory.
typedef struct {
/*000*/ GenericStack *stateStack;
/*004*/ f32 timer;
        // Where in the current segment the boss in, ranging from 0-1.
        // When reversed (moving counter-clockwise), this value progresses from 1 to 0 instead of 0 to 1.
/*008*/ f32 segmentPos;
/*00C*/ s32 standingUpSegment; // The last segment the boss stood up in after being knocked down.
        // The following fields are curve XYZ coords. These determine the positions used
        // for the A and B sides of each arena segment, for both clockwise and counter-clockwise movement.
/*010*/ f32 segStartCW_X[4];
/*020*/ f32 segStartCW_Y[4];
/*030*/ f32 segStartCW_Z[4];
/*040*/ f32 segEndCW_X[4];
/*050*/ f32 segEndCW_Y[4];
/*060*/ f32 segEndCW_Z[4];
/*070*/ f32 segEndCCW_X[4]; // Reversed positions start here (see above comments)
/*080*/ f32 segEndCCW_Y[4];
/*090*/ f32 segEndCCW_Z[4];
/*0A0*/ f32 segStartCCW_X[4];
/*0B0*/ f32 segStartCCW_Y[4];
/*0C0*/ f32 segStartCCW_Z[4];
        // The current A and B positions of each segment.
        // These are flipped when the boss is reversed (moving counter-clockwise).
/*0D0*/ f32 *segA_X;
/*0D4*/ f32 *segA_Y;
/*0D8*/ f32 *segA_Z;
/*0DC*/ f32 *segB_X;
/*0E0*/ f32 *segB_Y;
/*0E4*/ f32 *segB_Z;
        // World position that the boss should be in.
        // Moves to this position on the next tick.
        // Calculated by combining the current segment pos with the target curve pos.
/*0E8*/ Vec3f pos;
        // Where in the boss's current segment the player is, ranging from 0-1.
        // Note: This is *not* the pos of the player in their current segment. If the player is not in
        // the same segment as the boss, this value is not well defined.
/*0F4*/ f32 playerSegmentPos;
/*0F8*/ s16 turnStartYaw; // The yaw of the boss at the start of a turn.
/*0FA*/ u16 flags;
        // = 0 when walking around normally.
        // = 1 when charging at sabre.
        // = 2 when charging around the arena after getting zapped.
/*0FC*/ u8 anger;
/*0FD*/ u8 roarType;
        // Which arena segment the boss is in (bitfield).
        // This is used to check if the boss is in the same segment as the player.
/*0FE*/ u8 selfSegmentBitfield;
        // Which arena segment the player is in (bitfield).
        // Determined by triggers that set/unset gamebits as the player walks around the arena.
/*0FF*/ u8 playerSegmentBitfield;
/*100*/ u8 laserWallBitfield; // Bitfield of which laser walls are active.
/*101*/ u8 fightProgress; // Increases as the player progresses the fight by damaging the boss.
/*102*/ u8 health;
/*103*/ s8 chargeCounter; // How many segments to charge down. Decrements after each turn while charging.
/*104*/ s32 fxFlags;
/*108*/ u8 breathingSfxIndex;
/*10C*/ SRT unk10C;
/*124*/ SRT unk124;
/*13C*/ SRT unk13C;
/*154*/ SRT unk154;
/*16C*/ Vec3f unk16C;
} KTrex_Data;

typedef struct {
/*00*/ DLL33_ObjSetup base;
/*38*/ f32 speeds[3]; // Movement speed, per "anger" level.
/*44*/ u16 roarTime[3]; // How long a roar lasts.
/*4A*/ u16 vulnerableTime[4]; // How long the boss is vulnerable for.
/*52*/ u8 reverseChance[4]; // Chance to reverse direction.
/*56*/ u8 chargeChance[4]; // Chance to charge without seeing Sabre.
} KTrex_ObjSetup;

enum KTModAnims {
    KTANIM_Idle = 0,
    KTANIM_Walk1 = 1, // anger level 0
    KTANIM_Walk2 = 2, // anger level 1
    KTANIM_Walk3 = 3, // anger level 2
    KTANIM_Roar_Small = 4,
    KTANIM_Roar_VeryBig = 5, // unused
    KTANIM_Roar_Big = 6,
    KTANIM_Walk_Slow = 7, // creepy, unused
    KTANIM_Turn_90_CW_Normal = 8,
    KTANIM_Roar_ChargeEnd1 = 9, // referenced but unused due to logic
    KTANIM_Roar_10 = 10, // unused
    KTANIM_FallDown = 11,
    KTANIM_FlailOnGround = 12,
    KTANIM_GetBackUp = 13,
    KTANIM_Turn_90_CCW_Normal = 14,
    KTANIM_Turn_180 = 15,
    KTANIM_Turn_90_CW_Fast = 16,
    KTANIM_Turn_90_CCW_Fast = 17,
    KTANIM_Roar_ChargeEnd2 = 18
};

enum KTModAnimEvents {
    KTANIM_EVT_0_Speak = 0,
    KTANIM_EVT_1_Footfall_Left = 1,
    KTANIM_EVT_2_Footfall_Right = 2,
    KTANIM_EVT_7 = 7,
    KTANIM_EVT_9_Spit_Partfx_Enable = 9,
    KTANIM_EVT_10_Spit_Partfx_Disable = 10
};
